In [ ]:
# Warning Disable! Ignore!!!

import warnings
warnings.filterwarnings('ignore')

# Introduction to Myself


# First Steps

- Download Anaconda https://anaconda.org/
- Install Anaconda
- Open Anaconda & Start a New Jupyter Notebook

# Introduction to Pandas



## Reminders about importing and documentation

In [2]:
import pandas as pd
pd?

In [3]:
import numpy as np

## Basic Pandas Data Structures


### `Series`!

In [4]:
s1 = pd.Series([-0.5, 0.75, 1.0, -2])
s1

0   -0.50
1    0.75
2    1.00
3   -2.00
dtype: float64

In [5]:
s1.values

array([-0.5 ,  0.75,  1.  , -2.  ])

In [6]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
s1[1]

0.75

In [8]:
s1[1:3]

1    0.75
2    1.00
dtype: float64

In [9]:
s2 = pd.Series([-0.5, 0.75, 1.0, -2], index=['a', 'b', 'c', 'd'])
s2

a   -0.50
b    0.75
c    1.00
d   -2.00
dtype: float64

### Explicit Indices in Series:

In [10]:
s2['b']

0.75

#### Exercise:

In [11]:
# Do explicit Series indices work *exactly* the way you might expect?
# Try slicing s2 using its explicit index and find out.

b    0.75
c    1.00
d   -2.00
dtype: float64

In [12]:
s2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
popd = {'France': 65429495,
        'Germany': 82408706,
        'Russia': 143910127,
        'Japan': 126922333}
pops = pd.Series(popd)
pops

France      65429495
Germany     82408706
Russia     143910127
Japan      126922333
dtype: int64

In [14]:
pops['Russia']

143910127

In [15]:
# Try slicing on the population Series on your own.

pops['France':'Russia']

France      65429495
Germany     82408706
Russia     143910127
dtype: int64

In [16]:
# Try running pops['Albania'] = 2937590 (or another country of your choice)
pops['Albania'] = 2937590
pops

France      65429495
Germany     82408706
Russia     143910127
Japan      126922333
Albania      2937590
dtype: int64

In [17]:
pop2 = pd.Series({'Spain': 46432074, 'France': 102321, 'Albania': 50532})
pops + pop2

Albania     2988122.0
France     65531816.0
Germany           NaN
Japan             NaN
Russia            NaN
Spain             NaN
dtype: float64

### `DataFrame`!

In [18]:
aread = {'Albania': 28748,
         'France': 643801,
         'Germany': 357386,
         'Japan': 377972,
         'Russia': 17125200}
areas = pd.Series(aread)
areas

Albania       28748
France       643801
Germany      357386
Japan        377972
Russia     17125200
dtype: int64

In [20]:
countries['Capital'] = ['Tirana', 'Paris', 'Berlin', 'Tokyo', 'Moscow']
countries

         Population      Area Capital
Albania     2937590     28748  Tirana
France     65429495    643801   Paris
Germany    82408706    357386  Berlin
Japan     126922333    377972   Tokyo
Russia    143910127  17125200  Moscow

In [21]:
countries = countries[['Capital', 'Area', 'Population']]
countries

        Capital      Area  Population
Albania  Tirana     28748     2937590
France    Paris    643801    65429495
Germany  Berlin    357386    82408706
Japan     Tokyo    377972   126922333
Russia   Moscow  17125200   143910127

In [22]:
countries['Population Density'] = countries['Population'] / countries['Area']
countries

        Capital      Area  Population  Population Density
Albania  Tirana     28748     2937590          102.184152
France    Paris    643801    65429495          101.629999
Germany  Berlin    357386    82408706          230.587393
Japan     Tokyo    377972   126922333          335.798242
Russia   Moscow  17125200   143910127            8.403413

In [23]:
countries['Area']

Albania       28748
France       643801
Germany      357386
Japan        377972
Russia     17125200
Name: Area, dtype: int64

In [25]:
# Now try accessing row data with a command like countries['Japan']

KeyError: 'Albania'

In [ ]:
countries.loc['Albania']

In [ ]:
countries.loc['Albania']['Area']

In [ ]:
# Can you think of a way to return the area of Albania without using .loc?
# Hint: Try putting the column index first.
# Can you slice along these indices as well?

In [ ]:
countries['Debt-to-GDP Ratio'] = np.nan
countries

In [ ]:
debt = pd.Series([0.19, 2.36], index=['Russia', 'Japan'])
countries['Debt-to-GDP Ratio'] = debt
countries

In [ ]:
del countries['Capital']
countries

In [26]:
countries.T

                       Albania      France     Germany       Japan     Russia
Capital                 Tirana       Paris      Berlin       Tokyo     Moscow
Area                     28748      643801      357386      377972   17125200
Population             2937590    65429495    82408706   126922333  143910127
Population Density  102.184152  101.629999  230.587393  335.798242   8.403413

#### Creating a DataFrame from a two-dimensional NumPy array

In [27]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.964884  0.959214
b  0.598791  0.169144
c  0.173789  0.955099

## Manipulating data in pandas

### Index objects in pandas

In [28]:
s1 = pd.Series([-0.5, 0.75, 1.0, -2], index=['a', 'b', 'c', 'd'])
ind1 = s1.index
ind1

Index(['a', 'b', 'c', 'd'], dtype='object')

In [29]:
ind1[1]

'b'

In [30]:
ind1[::2]

Index(['a', 'c'], dtype='object')

In [31]:
ind1[1] = 0

TypeError: Index does not support mutable operations

In [37]:
ind2odd = pd.Index([1, 3, 5, 7, 9])
ind2prime = pd.Index([2, 3, 5, 7, 11])

In [38]:
print(ind2odd & ind2prime)
print(ind2odd | ind2prime)
print(ind2odd ^ ind2prime)

Int64Index([3, 5, 7], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
Int64Index([1, 2, 9, 11], dtype='int64')

| **Method**     | **Description**                                                                           |
|:---------------|:------------------------------------------------------------------------------------------|
| [`append`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html)       | Concatenate with additional `Index` objects, producing a new `Index`                      |
| [`diff`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.diff.html)         | Compute set difference as an Index                                                        |
| [`drop`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)         | Compute new `Index` by deleting passed values                                             |
| [`insert`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.insert.html)       | Compute new `Index` by inserting element at index `i`                                     |
| [`is_monotonic`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.is_monotonic.html) | Returns `True` if each element is greater than or equal to the previous element           |
| [`is_unique`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.is_unique.html)    | Returns `True` if the Index has no duplicate values                                       |
| [`isin`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isin.html)         | Compute boolean array indicating whether each value is contained in the passed collection |
| [`unique`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.unique.html)       | Compute the array of unique values in order of appearance                                         |

### Data Selection in Series

In [39]:
s2 = pd.Series([-0.5, 0.75, 1.0, -2], index=['a', 'b', 'c', 'd'])
s2

a   -0.50
b    0.75
c    1.00
d   -2.00
dtype: float64

In [40]:
s2['b']

0.75

In [41]:
# Checking if key/index is present in Series

'a' in s2

True

In [42]:
# Getting all keys/indices, same as s2.index

s2.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [43]:
# List of all items in the series as list of a (key, value) pairs

list(s2.items())

[('a', -0.5), ('b', 0.75), ('c', 1.0), ('d', -2.0)]

In [44]:
s2['e'] = 1.25
s2

a   -0.50
b    0.75
c    1.00
d   -2.00
e    1.25
dtype: float64

#### Series as one-dimensional array

In [45]:
# Slicing using the explicit index
s2['a':'c']

a   -0.50
b    0.75
c    1.00
dtype: float64

In [46]:
# Slicing using the implicit integer index
s2[0:2]

a   -0.50
b    0.75
dtype: float64

In [47]:
# Masking: Values which satisy the conditions are used to get the values themselves.
# Eg. Here, s2>-1 and s2<0.8 are only satisfied at index 'a' & index 'b', hence they are returned which is
# passed through as s2[['a','b']] and hence printing both
s2[(s2 > -1) & (s2 < 0.8)]

a   -0.50
b    0.75
dtype: float64

In [48]:
# Fancy indexing - List is passed to include mutiple unique indexes from Series.
s2[['a', 'e']]

a   -0.50
e    1.25
dtype: float64

#### Indexers: `loc` and `iloc`

In [49]:
s2.loc['a']

-0.5

In [50]:
s2.loc['a':'c']

a   -0.50
b    0.75
c    1.00
dtype: float64

In [51]:
s2.iloc[0]

-0.5

In [52]:
s2.iloc[0:2]

a   -0.50
b    0.75
dtype: float64

### Data selection in DataFrames

#### DataFrame as dictionary of Series

In [53]:
areas = pd.Series({'Albania': 28748,
                  'France': 643801,
                  'Germany': 357386,
                  'Japan': 377972,
                  'Russia': 17125200})
pops = pd.Series ({'Albania': 2937590,
                         'France': 65429495,
                         'Germany': 82408706,
                         'Russia': 143910127,
                         'Japan': 126922333})
countries = pd.DataFrame({'Area': areas, 'Population': pops})
countries

             Area  Population
Albania     28748     2937590
France     643801    65429495
Germany    357386    82408706
Japan      377972   126922333
Russia   17125200   143910127

In [54]:
countries['Area']

Albania       28748
France       643801
Germany      357386
Japan        377972
Russia     17125200
Name: Area, dtype: int64

In [55]:
countries['Population Density'] = countries['Population'] / countries['Area']
countries

             Area  Population  Population Density
Albania     28748     2937590          102.184152
France     643801    65429495          101.629999
Germany    357386    82408706          230.587393
Japan      377972   126922333          335.798242
Russia   17125200   143910127            8.403413

#### DataFrame as two-dimensional array

In [56]:
countries.values

array([[2.87480000e+04, 2.93759000e+06, 1.02184152e+02],
       [6.43801000e+05, 6.54294950e+07, 1.01629999e+02],
       [3.57386000e+05, 8.24087060e+07, 2.30587393e+02],
       [3.77972000e+05, 1.26922333e+08, 3.35798242e+02],
       [1.71252000e+07, 1.43910127e+08, 8.40341292e+00]])

In [57]:
countries.T

,Albania,France,Germany,Japan,Russia
Area,2.874800e+04,6.438010e+05,3.573860e+05,3.779720e+05,1.712520e+07
Population,2.937590e+06,6.542950e+07,8.240871e+07,1.269223e+08,1.439101e+08
Population Density,1.021842e+02,1.016300e+02,2.305874e+02,3.357982e+02,8.403413e+00

In [58]:
countries.iloc[:3, :2]

           Area  Population
Albania   28748     2937590
France   643801    65429495
Germany  357386    82408706

In [59]:
countries.loc[:'Germany', :'Population']

           Area  Population
Albania   28748     2937590
France   643801    65429495
Germany  357386    82408706

#### Indexing conventions

In [60]:
countries['France':'Japan']

           Area  Population  Population Density
France   643801    65429495          101.629999
Germany  357386    82408706          230.587393
Japan    377972   126922333          335.798242

In [61]:
countries[1:3]

           Area  Population  Population Density
France   643801    65429495          101.629999
Germany  357386    82408706          230.587393

In [62]:
countries[countries['Population Density'] > 200]

           Area  Population  Population Density
Germany  357386    82408706          230.587393
Japan    377972   126922333          335.798242

# Operating on Data in Pandas

## Index Preservation

In [63]:
rng = np.random.RandomState(42)
ser_example = pd.Series(rng.randint(0, 10, 4))
ser_example

0    6
1    3
2    7
3    4
dtype: int32

In [64]:
df_example = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df_example

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [65]:
np.exp(ser_example)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [66]:
np.cos(df_example * np.pi / 4)

              A             B             C             D
0 -1.836970e-16  7.071068e-01  6.123234e-17 -1.836970e-16
1  7.071068e-01 -1.000000e+00 -7.071068e-01  7.071068e-01
2  7.071068e-01  6.123234e-17 -7.071068e-01 -1.000000e+00

## Index alignment

### Index alignment with Series

In [67]:
areas = pd.Series({'Russia': 17075400, 'Canada':  9984670,
                  'USA': 9826675, 'China': 9598094, 
                  'Brazil': 8514877}, name='area')
pops = pd.Series({'China': 1409517397, 'India': 1339180127,
                        'USA': 324459463, 'Indonesia': 322179605, 
                        'Brazil': 207652865}, name='population')

In [68]:
# Now divide these to compute the population density

Brazil        24.387066
Canada              NaN
China        146.853885
India               NaN
Indonesia           NaN
Russia              NaN
USA           33.018235
dtype: float64

In [69]:
series1 = pd.Series([2, 4, 6], index=[0, 1, 2])
series2 = pd.Series([3, 5, 7], index=[1, 2, 3])
series1 + series2

0     NaN
1     7.0
2    11.0
3     NaN
dtype: float64

In [70]:
series1.add(series2, fill_value=0)

0     2.0
1     7.0
2    11.0
3     7.0
dtype: float64

### Index alignment with DataFrames

In [71]:
df1 = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                   columns=list('AB'))
df1

   A   B
0  1  11
1  5   1

In [72]:
df2 = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                   columns=list('BAC'))
df2

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [74]:
fill = df1.stack().mean()
df1.add(df2, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

This table lists Python operators and their equivalent pandas object methods:

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

## Operations between DataFrames and Series

In [75]:
df3 = pd.DataFrame(rng.randint(10, size=(3, 4)), columns=list('WXYZ'))
df3

   W  X  Y  Z
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

In [76]:
df3 - df3.iloc[0]

   W  X  Y  Z
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [77]:
df3.subtract(df3['X'], axis=0)

   W  X  Y  Z
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [78]:
halfrow = df3.iloc[0, ::2]
halfrow

W    3
Y    2
Name: 0, dtype: int32

In [79]:
df3 - halfrow

     W   X    Y   Z
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

# Questions & Answers

Q1) What is reindexing in Pandas?

A1) Reindexing is used to conform DataFrame to a new index with optional filling logic. It places NA/NaN in that location where the values are not present in the previous index. It returns a new object unless the new index is produced as equivalent to the current one, and the value of copy becomes False. It is used to change the index of the rows and columns of the DataFrame.

Q2) Can you explain the different types of data structures in Pandas?

A2) As we discussed earlier, Pandas provides two data structures, which are supported by the pandas library, Series, and DataFrames. Both of these data structures are built on top of the NumPy. A Series is a one-dimensional data structure, whereas a DataFrame is the two-dimensional data structure.

Q3) How can I rename the index of a DataFrame?

A3) You can use the .rename method to give different values to the index values of DataFrame. This will also work for renaming the columns of the DataFrame.

Q4) How can we sort the DataFrame?

A4) We can efficiently perform sorting in the DataFrame through different kinds:

    By label
    By Actual value

By label

The DataFrame can be sorted by using the sort_index() method. It can be done by passing the axis arguments and the order of sorting. The sorting is done on row labels in ascending order by default.

By Actual Value

It is another kind through which sorting can be performed in the DataFrame. Like index sorting, sort_values() is a method for sorting the values.

It also provides a feature in which we can specify the column name of the DataFrame with which values are to be sorted. It is done by passing the 'by' argument.

Q5) What is Time Series in Pandas?

A5) The Time series data is defined as an essential source for information that provides a strategy that is used in various businesses. From a conventional finance industry to the education industry, it consists of a lot of details about the time. Time series forecasting is the machine learning modeling that deals with the Time Series data for predicting future values through Time Series modeling.

Q6)Can you explain mutiple indexing?

A6) Multiple indexing is defined as essential indexing because it deals with data analysis and manipulation, especially for working with higher dimensional data. It also enables us to store and manipulate data with the arbitrary number of dimensions in lower-dimensional data structures like Series and DataFrame.

Q7) What is GroupBy() in pandas?

A7) In Pandas, groupby() function allows us to rearrange the data by utilizing them on real-world data sets. Its primary task is to split the data into various groups. These groups are categorized based on some criteria. The objects can be divided from any of their axes.